/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"ignore_button" = "Ignore";
/* ProgramLog, Details view - AAPLogObject */
"program_log_data_size" = "Data size";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_status" = "Status";

/* ProgramLog, Details view, connection ID title. Text - "Connection ID" */
"programlog_details_connection_id_title" = "Connection ID";

/* ProgramLog, Details view, request ID title. Text - "Request ID" */
"programlog_details_request_id_title" = "Request ID";

/* ProgramLog, Details view, title for event source. Text - "Event source" */
"programlog_details_event_source_title" = "Event source";

/* ProgramLog, Details view, stealth mode event source. Text - "Stealth mode" */
"programlog_details_event_source_stealth_mode" = "Stealth mode";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_cookie" = "Cookie";

/* ProgramLog, details view, status */
"program_log_details_status_html_removed" = "HTML element removed";

/* ProgramLog, details view, status */
"program_log_details_status_cookie_modified" = "Cookie modified";

/* ProgramLog, details view, text: "HTML Element" */
"program_log_details_html_element" = "HTML Element";

/* ProgramLog, details view, text:  "Source URL" */
"program_log_details_source_url" = "Source URL";

/* ProgramLog, filter name cell in request row, when only modified by stealth mode. Text like "Stealth mode" */
"programlog_filtername_cell_stealth_mode" = "Stealth mode";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_cookie_original" = "Original";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_cookie_modified" = "Modified";

/* "ProgramLog, filter name cell in request row, when only modified by cosmetic rules. Text like "Cosmetic rules" */
"programlog_filtername_cell_сosmetic_rules" = "Cosmetic rules";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_protocol_title" = "Protocol";
/* Master password prompt dialog shown during the root certificate installation for Gecko-like browsers. Explanatory text. Text in square brackets will be transformed into instruction hyperlink. */
"master_password_prompt_dialog_certificate_installation_text" = "To successfully install AdGuard certificate or remove it from the certificate store %1$@ requires a master password. The password you enter will not be saved and will be used only once to import the certificate. As an alternative, you can install the certificate manually by following [these instructions].\n\n(Current profile: %2$@)";

/* Main Panel - AAStatusBarMenuController */
"main_panel_statistics_since" = "Statistics since %@";

/* Create empty rule - ASDatabaseObjects */
"entering_rule_database" = "!------- Enter a rule here... ---------!";

/* Preferenses - Ad Blocker - AAPrefAdBlockFiltersTableDelegate */
"preferences_adblocker_updated_date" = "%1$@ updated %2$@";

/* (AAAppDelegate) User Notifications */
"certificate_added_to_EVexclusions_notification" = "\"%@\" certificate has been added to EV exclusions. Websites with this certificate will not be filtered unless the respective option for EV certificates is disabled.";

/* AAAppDelegate */
"rule_added_user_filter" = "A new rule was added to User rules:";

/* AAAppDelegate */
"rule_removed_user_filter" = "A rule was removed from User rules:";

/* Main Panel - Activate Button (AAStatusBarMenuController) */
"main_panel_activate_button" = "Activate";

/* License Window - AALicense */
"license_window_activate_license_button" = "Activate";

/* Preferences - Ad Block - Rules Export */
"rules_export_choose_file" = "AdGuard - Choose a file for exporting";

/* Preferences - Ad Block - Rules Import */
"rules_import_choose_file" = "AdGuard - Choose a file for importing";

/* (AAPAdBlockCustomFilterSubscribe) Window title when selecting file with local custom filter */
"choosing_file_with_custom_filter_title" = "AdGuard - Choose a file with custom filter";

/* Preferences - Filtering Apps - AAPrefFilteringAppsSettings */
"preferences_filtered_apps_choose_app" = "AdGuard - Choose the application for filtering";

/* Master password prompt dialog shown during the root certificate installation for Gecko-like browsers. Window title. */
"master_password_window_title" = "AdGuard - Master password for %@";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"error_filtering_https_alert_message" = "AdGuard can't filter HTTPS traffic in %@!";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"error_removing_certificate_alert_message" = "AdGuard can't remove AdGuard CA certificate from %@!";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"root_certificate_installed_text" = "AdGuard has successfully installed the root certificate into %@ certificate store. HTTPS filtering is enabled now.";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"root_certificate_installed_title" = "AdGuard has successfully installed the root certificate.";

/* AAAppDelegate */
"functioning_stopped_alert_message" = "AdGuard is not functioning!";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"installing_certificate_failure_text" = "AdGuard was not able to install the root certificate into %@ certificate store! Please contact customer support.";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"removing_certificate_failure_text" = "AdGuard was not able to remove the root certificate from %@ certificate store! The process of resetting the AdGuard settings will continue.";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"failed_to_close_alert_message" = "AdGuard wasn't able to close %@. Try again?";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"installing_certificate_failure_title" = "AdGuard wasn't able to install the root certificate into %@!";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"removing_certificate_failure_title" = "AdGuard wasn't able to remove the root certificate from %@!";

/* (AAPreference) Title for the \"Filter EV certificates anyway\" window. */
"filtering_websites_anyway_text" = "AdGuard will filter traffic for websites listed below despite them having EV certificates.";

/* (AAPreference) Title for SSL Exception list window. */
"ssl-exception_list_title" = "AdGuard won't filter encrypted traffic for the sites listed below.";

/* Settting message text - AAPrefDomainExclusions */
"no_filtering_for_websites_setting_message_text" = "AdGuard won't filter traffic for the sites listed below.";

/* AAAppDelegate */
"incorrect_work_alert_message" = "AdGuard won't work correctly!";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_ajax" = "Ajax";

/* AAAppDelegate */
"error_init_database_title" = "An error occurred during the initialization of the AdGuard database. AdGuard won't work correctly. Please contact the support team.";

/* AAAppDelegate */
"error_init_database_text_template" = "An error occurred during the initialization of the AdGuard database. AdGuard won't work correctly.\n\n... insert your text here ...\n";

/* (AAAppDelegate) Alert message when update process of the user preferences was completed with error. */
"error_upgrade_preferences_message" = "An error occurred during the user preferences upgrade. AdGuard won't work correctly. You may attempt to reset the application preferences to default or contact the support team.";

/* AAAppDelegate */
"error_upgrade_preferences_title" = "An error occurred during the user preferences upgrade. AdGuard won't work correctly. Please contact the support team.";

/* AAAppDelegate */
"error_upgrade_preferences_text_template" = "An error occurred during the user preferences upgrade.\nAdGuard won't work correctly.\n\n... insert your text here ...\n";
/* (AAPreferences) Preferences - Network - Enable proxy failure alert. Informative text when common case happened */
"error_starting_http_proxy" = "An error occurred while attempting to start the AdGuard HTTP proxy. Please contact the developer.";

/* (AAPreferences) Preferences - Network - Enable proxy failure alert. Informative text when port in use. */
"error_starting_http_proxy_port_in_use" = "An error occurred while attempting to start the AdGuard HTTP proxy. Port %@ is in use.";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"error_submitting_crash_report" = "An error occurred while submitting the crash report.";

/* (AAAppDelegate) User Notifications */
"error_updating_filters" = "An error occurred while updating filters.";

/* ProgramLog - AAPLogObject */
"program_log_exception_activated" = "An exception was activated.";

/* About - AAAbout */
"app_version" = "Application version";

/* (AAPreference) Message text (aka title) on dialog window. It occurs when user disables https filtering in Preferences Network Tab. */
"dialog_window_text_attention" = "Attention!";

/* ProgramLog - AAPLogObject */
"program_log_blocked_by_parental" = "Blocked by Parental Control";

/* ProgramLog, Details view - AAPLogObject */
"program_log_bytes_received" = "Bytes received: ";

/* ProgramLog, Details view - AAPLogObject */
"program_log_bytes_sent" = "Bytes sent: ";
/* Crash Reporter UI (SFBCrashReporterWindowController) */
"crash_reporter_backend_server" = "Can't connect to backend server.";

/* AAAppDelegate */
"error_running_app" = "Can't run AdGuard from this location!";

/* (AAPreference) Cancel button for the message about EV settings customization.
   (AAPreference) Cancel button on dialog window. It occurs when user disables https filtering in Preferences Network Tab.
   Preferences - Ad Block - AAPrefAdBlockController */
"cancel_button" = "Cancel";

/* (AAPreference) Message about EV settings customization. */
"certificate_added_to_EVexclusions_message" = "Certificate for \"%1$@\" has been added to EV exclusions. Websites with this certificate will not be filtered unless the respective option for EV certificates is disabled. You can force filtering on \"%1$@\" despite it's EV certificate. To do so, click \"Filter anyway\" button.";

/* (AAPAdBlockCustomFilterSubscribe) Title on Close button in error message
   AAAppDelegate
   Alert that GECKO is active (AAGeckoBrowsersAlert)
   Preferences - Ad Block - AAPrefAdBlockController
   Request user about resetting AdGuard (AAResetSettings) */
"close_button" = "Close";

/* ProgramLog, resource type - AAPLogObject */
"program_log_connection" = "Connection";

/* ProgramLog, Details view - Status */
"program_log__connection_blocked" = "Connection blocked.";

/* UI - License Window - Alert - AdGuard service connection error - Error message */
"activity_status_connection_error" = "Connection error.";

/* (AAAppDelegate) User Notifications */
"notification_connection_closed" = "Connection has been closed";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_connection" = "Connection: ";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_content_rules" = "Content rules:";

/* (AAPreference) Continue button on dialog window. It occurs when user disables https filtering in Preferences Network Tab.
   Preferences - Ad Block - AAPrefAdBlockController */
"preferences_network_continue_button" = "Continue";

/* Error converting to email (AASendMessageMailFormatter) */
"error_converting_message" = "Couldn’t convert to valid email";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"window_controller_crash_reporter" = "Crash Reporter: %1$@ (%2$@)";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"window_controller_crash_reporter1" = "Crash Reporter: %@";

/* ProgramLog, resource type - AAPLogObject */
"resource_type_css" = "CSS";

/* (AAAppDelegate) User Notifications button */
"user_notification_button_customize" = "Customize";

/* (AAPreference) Title of the message about EV settings customization. */
"filtering_customization_message_title" = "Customize filtering on the %@ website";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_data_type" = "Data type";

/* (AAPrefAdBlockController) Undo operation title. */
"disable_rules_undo_operation_title" = "Disable Rules";

/* (AAPrefAdBlockController) Undo operation title. */
"edit_filter_undo_operation_title" = "Edit Filter";

/* (AAPrefAdBlockController) Undo operation title. */
"edit_rule_undo_operation_title" = "Edit Rule";

/* (AAPrefAdBlockController) Undo operation title. */
"search_string_undo_operation_title" = "Edit Search String";

/* (AAPrefAdBlockController) Undo operation title. */
"enable_rules_undo_operation_title" = "Enable Rules";

/* Master password prompt dialog shown during the root certificate installation for Gecko-like browsers. Placeholder for input field. */
"prompt_dialog_entering_master_password" = "Enter the master password";

/* (AAPAdBlockCustomFilterSubscribe) Title of the error message. */
"error_loading_filter_title" = "Error loading filter.";

/* Send feedback to support (AASendMessage) */
"error_sending_message" = "Error occurred when sending message.";

/* ProgramLog, Details view - AAPLogObject */
"program_log_error_processing_request" = "Error processing the request: ";

/* ProgramLog - AAPLogObject */
"program_log_error" = "Error!";


"enter_domain_name_message" = "Enter a domain name here...";
/* Preferences - Ad Block - AAPrefAdBlockController */
"preferences_exit_editing_mode_text" = "Exit the advanced editing mode for \"%@\". Are you sure?";

/* Preferences - Ad Block - AAPrefAdBlockController */
"preferences_exit_editing_mode_title" = "Exit the advanced editing mode?";

/* (AAPreferences) Preferences - Network - Enable proxy failure alert. Title text. */
"enabling_proxy_failure_alert" = "Failed to enable the proxy mode.";

/* Preferences - Ad Block - AAPrefAdBlockFiltersSubscribe */
"installing_filters_failure_alert" = "Failed to install filters.";

/* (AAAppDelegate) User Notifications */
"user_notification_filters_auto-activation_text" = "Filter \"%@\" activated automatically, according to websites you visited.";

/* (AAAppDelegate) User Notifications */
"user_notification_filters_auto-activation_title" = "Filter activated automatically";

/* (AAPreference) Text on the button in the message about EV settings customization. */
"filter_anyway_message_button" = "Filter anyway";


/* ProgramLog, Details view - AAPLogObject */
"program_log_details_filter" = "Filter: ";
/* (AAAppDelegate) User Notifications */
"filters_updated_notification_title" = "Filters updated";

/* (AAAppDelegate) User Notifications */
"notification_filters_updated_text" = "Filters updated: %lu. You are using the most recent version of filter databases.";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"alert_fix_this" = "Fix this";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_font" = "Font";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_html" = "HTML";

/* Request user about resetting AdGuard (AAResetSettings) */
"reseting_settings_request" = "If you click \"Reset\", AdGuard will attempt to reset all your settings, including enabled filters and custom filter rules. After the restart, AdGuard will behave as it did after its initial launch.";


/* (AAAppDelegate) User Notifications */
"notification_filters_update_error" = "Filters update error";
/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_image" = "Image";

/* (AAPrefAdBlockController) Undo operation title. */
"import_rules_undo_operation_title" = "Import Rules";

/* AAAppDelegate */
"important" = "Important";

/* AAAppDelegate */
"information" = "Information";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"crash_report_backend_server_error" = "Internal backend server error.";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_javascript" = "JavaScript";

/* ProgramLog - AAPLogObject */
"program_log_javascript_blocked" = "JavaScript blocked.";

/* Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_key_does_not_exist" = "Key does not exist.";

/* Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_license_expires" = "License expires *today.*";

/* Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_license_expires_in" = "License expires in *%lu day.*";

/* Activity Status (License Window - AALicense)
   Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_license_expired" = "License is expired.";

/* Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_maximum_exceeded" = "The maximum number of devices was exceeded.";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_media" = "Media";

/* Send feedback to support (AASendMessage) */
"feedback_message_sent" = "Message sent successfully.";

/* AAAppDelegate */
"running_app_from_application_folder_message" = "Most likely you are trying to run AdGuard from the installation disk. Drag the application icon to the Applications folder, and try to run it from there.";

/* (AAPrefAdBlockController) Undo operation title. */
"new_rule_undo_operation_title" = "New Rule";

/* Preferences - Ad Block - AAPrefAdBlockController
   Preferences - Filtering Apps - AAPrefFilteringAppsSettings */
"preferences_adblocker_filtered_apps_no" = "No";

/* (AAAppDelegate) User Notifications */
"no_filter_updates_notification" = "No filter updates found";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_object" = "Object";

/* (AAPreferences) Preferences - Network - Enable proxy failure alert. Ok button text
   Preferences - Ad Block - AAPrefAdBlockFiltersSubscribe */
"preferences_network_failure_alert_button" = "OK";

/* Preferences - Ad Block - AAPrefAdBlockController */
"preferences_adblocker_editing_mode_message" = "Only one filter can be in advanced editing mode at a time. Currently, the \"%1$@\" filter is already in advanced editing mode. If you click \"Continue\", the editing of the \"%1$@\" filter will be interrupted, without saving any changes.";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_other" = "Other";

/* (AAPrefAdBlockController) Undo operation title. */
"paste_rules_undo_operation_title" = "Paste Rules";

/* ProgramLog - AAPLogObject */
"program_log_phishing_site" = "Phishing site!";

/* (AAPreference) Informative text on dialog window. It occurs when user disables https filtering in Preferences Network Tab. */
"dialog_window_disabling_https-filtering_text" = "Please be aware that disabling HTTPS filtering will result in ads on many websites and in many apps, including popular ones such as Facebook, Youtube, Twitter, etc.";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"crash_report_problem_description" = "Please enter a description of the actions leading up to the crash.";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_process" = "Process: ";

/* Main Panel (AAStatusBarMenuController) */
"main_panel_protection_disabled" = "Protection is disabled";

/* Main Panel (AAStatusBarMenuController) */
"main_panel_protection_enabled" = "Protection is enabled";

/* Main Panel - AAStatusBarMenuController */
"main_panel_purchase" = "Purchase";

/* License Window - AALicense */
"license_window_purchase_license" = "Purchase license";

/* Request user about restarting AdGuard (AAResetSettings) */
"restarting_request_quit" = "Quit";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_referrer" = "Source URL";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_remote_address" = "Remote Address: ";

/* Preferences - Ad Block - AAPrefAdBlockController
   Preferences - Filtering Apps - AAPrefFilteringAppsSettings */
"preferences_adblock_filtered_apps_remove" = "Remove";

/* Preferences - Ad Block - AAPrefAdBlockController */
"preferences_adblocker_removing_message_title" = "Remove '%@'. Are you sure?";

/* Preferences - Filtering Apps - AAPrefFilteringAppsSettings */
"preferences_filtered_apps_removing_message_title" = "Remove Application '%@'. Are you sure?";

/* (AAPrefAdBlockController) Undo operation title. */
"remove_rules_undo_operation_title" = "Remove Rules";

/* Preferences - Ad Block - AAPrefAdBlockController */
"preferences_adblocker_removing_message_text" = "Removing a filter is different from disabling it. It will be completely removed from your available filters list, until you subscribe to it again.";

/* Preferences - Filtering Apps - AAPrefFilteringAppsSettings */
"preferences_filtered_apps_removing_message_text" = "Removing an application will result in AdGuard not filtering it at all. You will have to add it back manually in order to filter it.";

/* License Window - AALicense
   Main Panel - AAStatusBarMenuController */
"main_panel_renew_option" = "Renew";

/* License Window - AALicense */
"license_window_renew_license" = "Renew license";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_request_blocked_by" = "Request blocked by VPaid filter.";

/* ProgramLog - AAPLogObject */
"program_log_request_blocked" = "Request blocked.";

/* ProgramLog - AAPLogObject */
"program_log_request_processed" = "Request processed.";

/* Main Panel - AAStatusBarMenuController
   Request user about resetting AdGuard (AAResetSettings) */
"reset_setting_button" = "Reset";

/* Request user about resetting AdGuard (AAResetSettings) */
"reset_settings_message" = "Reset AdGuard settings. Are you sure?";

/* License Window - AALicense */
"license_window_reset_key" = "Reset license key";

/* (AAAppDelegate) Alert message when update process of the user preferences was completed with error. Button one. */
"reset_preferences_alert_button" = "Reset Preferences";

/* Request user about restarting AdGuard (AAResetSettings) */
"restart_button" = "Restart";

/* Request user about restarting AdGuard (AAResetSettings) */
"restarting_request_message_text" = "Restart is required for AdGuard to resume work. Click \"Restart\" to do so.";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"alert_message_retry_button" = "Retry";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_rule" = "Rule";

/* Preferences - Ad Block - Rules Export */
"preferences_adblocker_rules_export" = "Rules";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_safebrowsing_filter" = "Safebrowsing filter";

/* Preferences - Ad Block - AAPrefAdBlockController */
"preferences_adblocker_save_button" = "Save";

/* Send feedback to support (AASendMessage) */
"sending_feedback_process" = "Sending...";

/* AAAppDelegate */
"error_filtering_traffic_text" = "The service for filtering network traffic was not started correctly. Please contact the support team.";

/* AAAppDelegate */
"error_filtering_traffic_text_support" = "The service for filtering network traffic was not started correctly.\n\n... insert your text here ...\n";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"installing_certificate_retry_alert_message" = "Since %1$@ is running now, AdGuard can't install the root certificate into the certificate store, which is required to filter HTTPS traffic. If you choose \"Retry\", AdGuard will close %2$@ and install the certificate.";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"removing_certificate_retry_alert_message" = "Since %1$@ is running now, AdGuard can't remove the root certificate from the certificate store, which is required to reset AdGuard settings. If you choose \"Retry\", AdGuard will close %2$@ and remove the certificate.";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"installing_certificate_fixthis_alert_message" = "Since %1$@ is running, AdGuard can't install the root certificate into the certificate store, which is required to filter HTTPS traffic. If you choose \"Fix this\", AdGuard will close %2$@ and install the certificate.";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"removing_certificate_fixthis_alert_message" = "Since %1$@ is running, AdGuard can't remove the root certificate from certificate store, which is required to reset AdGuard settings. If you choose \"Fix this\", AdGuard will close %2$@ and remove the certificate.";

/* AAAppDelegate */
"error_starting_service_message" = "Some AdGuard services were not started correctly. Please contact the support team.";

/* AAAppDelegate */
"error_starting_service_support" = "Some AdGuard services were not started correctly.\nAdGuard won't work correctly.\n\n... insert your text here ...\n";

/* (AASFilterSubscriptionParser) Error while processing the custom filter file. */
"error_processing_custom_filter_file" = "Something went wrong, or the file with custom filtering rules is in the wrong format.";

/* Main Panel - Renew Button (AAStatusBarMenuController) */
"main_panel_renew_button_starting_at_price" = "starting at";

/* (AAAppDelegate) Alert message when update process of the build settings was completed with error. Button two.
   (AAAppDelegate) Alert message when update process of the user preferences was completed with error. Button two.
   AAAppDelegate */
"support_option" = "Support...";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"crash_reporter_thanks_for_improving" = "Thank you for taking the time to help us improve %@!";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"crash_report_submitted" = "The crash report was successfully submitted.";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"crash_reporter_error_indication" = "The error was: %@";

/* ProgramLog - AAPLogObject */
"program_log_page_filtered" = "The page has been filtered.";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_malicious_site" = "The request has been blocked, since the site is likely to be a phishing or malicious site: ";

/* Preferences - Ad Block - AAPrefAdBlockFiltersSubscribe */
"preferences_adblocker_outdated_filters_alert_message" = "The update server is not currently available. The list of available filters is out of date!";

/* Preferences - Ad Block - AAPrefAdBlockFiltersSubscribe */
"contact_developer_details" = "To contact the developer ...";

/* Preferences - Ad Block - AAPrefAdBlockFiltersSubscribe */
"preferences_adblocker_subscribe_filters_text" = "To subscribe, you must select filters in the list below, and then click the 'Subscribe' button.";

/* Settting message text - AAPrefDomainExclusions */
"setting_whitelist_message_text" = "To use the Whitelist you must enable User rules in the Filters tab first.";

/* License Window - AALicense */
"license_window_trial_expires_in" = "trial expires in %lu day";

/* Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_trial_expires_today" = "Trial period expires *today.*";

/* Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_trial_expires_in" = "Trial period expires in *%lu day.*";

/* Main Panel - AAStatusBarMenuController */
"main_panel_upgrade_option" = "Upgrade";

/* License Window - AALicense */
"license_window_upgrade_license" = "Upgrade license";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_url" = "Request URL";

/* License Window - AALicense */
"license_window_used_on" = "used on";
/* AAAppDelegate */
"view_option" = "View";

/* AAAppDelegate */
"warning" = "Warning";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_websocket" = "Websocket";

/* Activity Status (License Window - AALicense) */
"activity_status_wrong key" = "Wrong key.";

/* Preferences - Ad Block - AAPrefAdBlockController */
"exit_editing_mode_alert_message_save" = "You are about to exit the advanced editing mode. To save the changes, click on \"Save\".";

/* (AAAppDelegate) User Notifications */
"using_recent_database_version_notification" = "You are using the most recent version of filter databases.";

/* Preferences - Ad Block - AAPrefAdBlockFiltersSubscribe */
"no_more_filters_allowed_alert_message" = "You have already subscribed to all filters available.\nYou need to remove some filters first.";

/* Send feedback to support (AASendMessage) */
"feedback_enter_valid_email" = "You must enter a valid email.";

/* Request user about restarting AdGuard (AAResetSettings) */
"restarting_request_message_title" = "You need to restart AdGuard.";

/* (AAAbout) About window, (All rights reserved) text. */
"about_window_all_rights_reserved" = "© 2009-%lu Adguard Software Limited. All rights reserved.";

/* ProgramLog, Details view, unknown filter name for rules block. Text - "Unknown filter". */
"programlog_detailview_rules_unknownfilter" = "Unknown filter";

/* ProgramLog, rule cell in request row, when replace rules was applyed. Text like "Modified (3 rules)" */
"programlog_rulecell_count" = "Modified (%lu rules)";

/* ProgramLog, Details view, title for app name. Text - "Application". */
"programlog_detailview_appname_title" = "Application";

/* ProgramLog, Details view, destination address title. Text - "Destination address" */
"programlog_detailview_dst_address_title" = "Destination address";

/* ProgramLog, Details view, destination port title. Text - "port:" */
"programlog_detailview_dst_port_title" = "port:";

/* ProgramLog - AAPLogObject. ("Connection blocked.") */
"programlog_detailview_rejected_status" = "Connection blocked";

/* ProgramLog - AAPLogObject. ("HTTPS connection bypassed.") */
"programlog_detailview_bypass_https_status" = "HTTPS connection bypassed";

/* ProgramLog - AAPLogObject. ("Connection bypassed.") */
"programlog_detailview_bypass_status" = "Connection bypassed";

/* ProgramLog, Stealth mode option title. Text - "Hiding referrer" */
"programlog_stealth_mode_option_HidingReferrer" = "Hiding Referrer";

/* ProgramLog, Stealth mode option title. Text - "Removing cookies from requests and/or response" */
"programlog_stealth_mode_option_BlockingCookies" = "Removing cookies from requests and/or responses";

/* ProgramLog, Stealth mode option title. Text - "Stripping URLs from tracking parameters like \"utm_source\" etc." */
"programlog_stealth_mode_option_StrippingUrl" = "Stripping URLs of tracking parameters like \"utm_source\" etc.";

/* ProgramLog, Stealth mode option title. Text - "Hiding real ip address" */
"programlog_stealth_mode_option_HidingIp" = "Hiding real IP address";

/* ProgramLog, Stealth mode option title. Text - "Hiding User-Agent header" */
"programlog_stealth_mode_option_HidingUserAgent" = "Hiding User-Agent header";

/* ProgramLog, Stealth mode option title. Text - "Adding Do-Not-Track (DNT) header" */
"programlog_stealth_mode_option_SendingDoNotTrackHeader" = "Adding Do-Not-Track (DNT) header";

/* ProgramLog, Stealth mode option title. Text - "Removing X-Client-Data header" */
"programlog_stealth_mode_option_RemovingXClientDataHeader" = "Removing X-Client-Data header";

/* ProgramLog, Stealth mode option title. Text - "Sending no-cache header that blocks ETag header (which is used for tracking)" */
"programlog_stealth_mode_option_DisablingThirdPartyCache" = "Sending no-cache header that blocks ETag header (which is used for tracking)";

/* ProgramLog, Stealth mode option title. Text - "Removing Authorization headers for third-party requests" */
"programlog_stealth_mode_option_BlockingThirdPartyAuthorization" = "Removing Authorization headers for third-party requests";

/* ProgramLog, Stealth mode option title. Text - "Blocking WebRTC" */
"programlog_stealth_mode_option_BlockingWebRtc" = "Blocking WebRTC";

/* ProgramLog, Stealth mode option title. Text - "Blocking push api" */
"programlog_stealth_mode_option_BlockingBrowserPushApi" = "Blocking Push API";

/* ProgramLog, Stealth mode option title. Text - "Blocking location api" */
"programlog_stealth_mode_option_BlockingBrowserLocationApi" = "Blocking Location API";

/* ProgramLog, Stealth mode option title. Text - "Blocking flash api" */
"programlog_stealth_mode_option_BlockingBrowserFlash" = "Blocking Flash API";

/* ProgramLog, Stealth mode option title. Text - "Blocking java api" */
"programlog_stealth_mode_option_BlockingBrowserJava" = "Blocking Java API";

/* ProgramLog, Details view, title for `stealth mode` block. Text - "Stealth mode". */
"programlog_detailview_stealth_mode_title" = "Stealth mode";

/* Add `Kb` unit to Saved Data: "%@ Kb" */
"stat_saved_data_kb" = "%@ KB";

/* Add `Mb` unit to Saved Data: "%@ Mb" */
"stat_saved_data_mb" = "%@ MB";

/* Add `Gb` unit to Saved Data: "%@ Gb" */
"stat_saved_data_gb" = "%@ GB";

/* Main Panel - AAStatusBarMenuController: "Since %@" */
"main_panel_stat_title" = "Since %@";

/* Text: "Statistics since %@" */
"main_panel_accessibility_stat_title" = "Statistics since %@";

/* Text: "System extension allowed" */
"service_kext_allowed_notification_text" = "System extension allowed";

/* ProgramLog, Details view, title for rules block. Text - "Rules". */
"programlog_detailview_appliedrules_title" = "Rules";

/* App starting process. Database error alert. Informative text: "An error occurred while accessing the AdGuard database. This might happen when you try to launch an older version of AdGuard after using a newer one previously." */
"app_alert_newer_db_version" = "An error occurred while accessing the AdGuard database. This might happen when you try to launch an older version of AdGuard after using a newer one previously.";

/* Text: AdGuard - Choose a file for exporting logs */
"export_logs_choose_file_panel_title" = "AdGuard - Choose a file for exporting logs";

/* Text: Choose folder */
"export_logs_choose_file_panel_button_title" = "Export";

/* , Warning pannel on bottom of the License Warning Window. Text: Protection will be disabled on %@ */
"license_repr_protection_will_disable" = "Protection will be disabled on %@";

/* Warning pannel on bottom of the License Warning Window. Text: Protection is disabled! */
"license_repr_protection_disabled" = "Protection is disabled!";

/* Title on the License Warning Window. Text: License\nexpires soon */
"license_repr_title_expires" = "License\nexpires soon";

/* Title on the License Warning Window. Text: Trial period has\nstarted */
"license_repr_title_trial_expires" = "Trial period has\nstarted";

/* Title on the License Warning Window. Text: Trial period\nhas expired */
"license_repr_title_trial_expired" = "Trial period\nhas expired";

/* Title on the License Warning Window. Text: License\nis expired */
"license_repr_title_expired" = "License\nis expired";

/* License Warning Window in trial mode. Text: Trial version\n%lu days left */
"license_repr_trial_version_left" = "Trial version\n%lu days left";

/* App name for filtering log. Text: AdGuard Proxy */
"adguard_proxy_app_name" = "AdGuard Proxy";

/* Dialog for moving application to Application folder */
"move_app_cant_move" = "Could not move to the Applications folder";

/* Dialog for moving application to Application folder */
"move_app_cancel_button_title" = "Do Not Move";

/* Dialog for moving application to Application folder */
"move_app_message" = "I can move myself to the Applications folder if you wish.";

/* Dialog for moving application to Application folder */
"move_app_move_button_title" = "Move to Applications Folder";

/* Dialog for moving application to Application folder */
"move_app_title" = "Move to the Applications folder?";

/* Dialog for moving application to Application folder */
"move_app_password_required_message" = "Note that this will require an administrator password.";

/* Dialog for moving application to Application folder */
"move_app_warning_message" = "This is necessary for correct application updates in the future.";

/* Text: Protection enabled */
"notification_first_successful_start" = "Protection enabled";

/* Preferenses - Extensions - Modified by user mark.*/
"preferences_extensions_modified_mark" = "Modified";

/* Preferenses - Extensions - Modified by user tooltip.*/
"preferences_extensions_modified_tooltip" = "This extension was modified by you.";

/* Preferenses - Extensions - Window title when selecting file with local custom extension */
"preferences_extensions_choosing_file_with_custom_extension" = "AdGuard - Choose a file with an extension";

/* Preferenses - Extensions - Error while processing the userscript file. */
"preferences_extensions_error_processing_userscript_file" = "Something went wrong, or the script with the extension is in the wrong format.";

/* Preferenses - Extensions - Text: This userscript installed already. */
"preferences_extensions_already_installed_title" = "This userscript already installed";

/* Preferenses - Extensions - Parametes editor window title template.*/
"preferenses_extensions_parameters_editor_title" = "Parameters - %@";

/* Preferenses - Extensions - Installation custom extension - Error loading. */
"preferences_extensions_error_loading_extension_title" = "Error loading extension";

/* Preferenses - Extensions - Installation custom extension - Installation error title. */
"preferences_extensions_installation_error_title" = "Installation of the extension failed";

/* Preferenses - Extensions - Installation custom extension - Saving error message. */
"preferences_extensions_installation_error_message" = "An error occurred while saving the extension. Please contact support.";

/* Preferenses - Extensions - Installation custom extension - Already installed erro message. */
"preferences_extensions_already_installed_message" = "Userscript \"%@\" already installed. If you press \"Continue\", the userscript will be replaced with this version.";

/* Preferenses - Extensions - Removing warning title. */
"preferences_extensions_remove_warning_title" = "Are you sure you want to delete the selected extension?";

/* Preferenses - Extensions - Removing warning message. */
"preferences_extensions_remove_warning_message" = "If you click \"Continue\", the extension will be deleted permanently.";

/* Preferenses - Extensions - Parametes editor error title. */
"preferenses_extensions_parameters_editor_error_title" = "An error occurred while checking extension parameters.";

/* Preferenses - Extensions - Parametes editor text encoding error message. */
"preferenses_extensions_parameters_editor_text_encoding_error_message" = "Failed to convert the text of extension parameters using UTF-8 encoding. Perhaps there are special characters in the text.";

/* Preferenses - Extensions - Parametes editor not dictionary error message. */
"preferenses_extensions_parameters_editor_not_dictionay_error_message" = "The set of extension parameters should be represented as a JSON dictionary, that is, in format {\"string\":\"string\"}.";

/* Preferenses - Extensions - Parametes editor, parameter value type error message. */
"preferenses_extensions_parameters_editor_value_type_error_message" = "Value type for \"%@\" must be specified (value string must have the prefix: \"[LString;\", \"[I;\", \"[B;\")";

/* Preferenses - Extensions - On editor window closing. Changed extension script warning title. */
"preferences_extensions_script_changed_warning_title" = "The extension script has been changed";

/* Preferenses - Extensions - On editor window closing. Changed extension script warning message. */
"preferences_extensions_script_changed_warning_message" = "To close the window with saving changes, click \"Save & Close\". To close the editor without saving the changes, click \"Close Anyway\".";

/* Preferenses - Extensions - Editor check script error title */
"preferences_extensions_editor_check_script_error_title" = "An error occurred while checking the extension script";

/* Preferenses - Extensions - Editor check script name error message */
"preferences_extensions_editor_check_script_name_error" = "The extension script must have a non-empty value for the 'name' field in the metadata.";

/* Common used 'Save & Close' title for buttons */
"save_and_close_button" = "Save & Close";

/* Common used 'Close Anyway' title for buttons */
"close_anyway_button" = "Close Anyway";

/* Common used 'Continue' title for buttons */
"continue_button" = "Continue";

/* Activity Status (License Window - AALicense)
   Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_trial_expired" = "Trial period has expired.";

/* UI - License Window - Account Activation Window - Account has no license - Error message. */
"license_window_account_no_license_error" = "We haven't found any eligible license keys to activate AdGuard";

/* License - Account service - Error while logining in to AdGuard account. */
"license_oauth_service_error" = "Something went wrong, can't obtain authorization from AdGuard service";

/* UI - License Window - Account Activation Window - Bad credential - Error message. */
"license_window_account_bad_credential_error" = "Invalid username or password";

/* UI - License Window - Account Activation Window - Account is disabled - Error message. */
"license_window_account_account_is_disabled_error" = "Account is disabled";

/* UI - License Window - Account Activation Window - Account is locked - Error message. */
"license_window_account_account_is_locked_error" = "Account is temporarily locked";

/* UI - License Window - Account Activation Window - Invalid 2FA token - Error message. */
"license_window_account_invalid_2fa_token_error" = "Invalid 2FA token";

/* UI - License Window - 'None' status */
"license_window_status_none" = "None";

/* UI - License Window - Status. Active status */
"license_window_status_active" = "Active";

/* UI - License Window - Status. License expired status */
"license_window_status_license_expired" = "Expired";

/* UI - License Window - Status. Trial expired status */
"license_window_status_trial_expired" = "Trial expired";

/* UI - License Window - Status. Expired soon status */
"license_window_status_expired_soon" = "License expires soon";

/* UI - License Window - Status. Wron key status */
"license_window_status_does_not_exist" = "Wrong key";

/* UI - License Window - Status. Wron key status - Long description */
"license_window_status_does_not_exist_long" = "License key not found! Please make sure you've entered a valid key or [log in] to your user account to locate the key.";

/* UI - License Window - Status. Maximum exceeded status */
"license_window_status_maximum_exceeded" = "Maximum exceeded";

/* UI - License Window - Status. Maximum exceeded status - Long description */
"license_window_status_maximum_exceeded_long" = "This license is activated on the maximum number of devices. Please [unbind][1] one of them before continuing or [purchase a new key][2].";

/* UI - License Window - Status. Blocked status */
"license_window_status_blocked" = "Blocked";

/* UI - License Window - Status. Blocked status - Long description */
"license_window_status_blocked_long" = "The license key has been blocked. Please contact AdGuard Support for more details.";

/* UI - License Window - Status. License lifetime status */
"license_window_status_lifetime" = "Lifetime license";

/* UI - License Window - Type. Normal type */
"license_window_standard_license" = "Standard";

/* UI - License Window - Type. Premium type */
"license_window_premium_license" = "Premium";

/* UI - License Window - Type. Bonus type */
"license_window_bonus_license" = "Bonus";

/* UI - License Window - Type. Beta type */
"license_window_beta_license" = "Beta";

/* UI - License Window - Type. Trial type */
"license_window_trial_licence" = "Trial";

/* UI - License window - Title of the error alert */
"license_ui_error_titile" = "Attention";

/* UI - License Window - License period 'None' */
"license_window_period_none" = "None";

/* UI - License Window - License period days value */
"license_window_period_days_left" = "%lu days left";

/* UI - License Window - License period 'Today left' value */
"license_window_period_today_left" = "expires today";

/* UI - License window - License period 'Lifetime' value */
"license_window_period_lifetime_title" = "Lifetime";

/* UI - Welcome window - HTTPS Filtering - Warning message with link to Knowledge Base */
"welcome_window_https_lean_more" = "HTTPS filtering requires installing a root certificate. [Learn more] about how this works.";
